InProgress/te_gurney/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (11 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    wing_baffle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (11 0 0);
    }
    tunnel
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (11 0 0);
    }
    wing
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
